/**************************************************************************************************************
>*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>ЧЕРДАКОВ КИРИЛЛСЕРГЕЕВИЧ<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>ИВТ-Б-01-Д-2020-1<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>ЗАДАНИЯ<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*№1 РАБОТА СО СТАНДАРТАМИ И НОРМАТИВНЫМИ ДОКУМЕНТАМИ В ИТ<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*=============================================================================================================*
*№4 ДАН ДВУМЕРНЫЙ МАССИВ. ВЫЯСНИТЬ, ЕСТЬ ЛИ СТРОКИ С ОДИНАКОВОЙ СУММОЙ ЭЛЕМЕНТОВ. ЕСЛИ ЕСТЬ, ВЫВЕСТИ ИХ НОМЕРА*
*=============================================================================================================*
*№5 I. ДОБАВИТЬ К ГАРАЖУ ВОЗМОЖНОСТЬ УДАЛЕНИЯ ИЗ НЕГО МАШИНЫ, А К КЛАССУ AUTO ДОБАВИТЬ ПОЛЕ С ГОС. НОМЕРОМ<<<<*
*>>II. БАЗОВЫЙ КЛАСС – ФАЙЛ. ПРОИЗВОДНЫЕ – ЗВУКОВОЙ ФАЙЛ И ВИДЕО-ФАЙЛ<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*СОЗДАТЬ КЛАСС КАТАЛОГ, КОТОРЫЙ МОЖЕТ СОДЕРЖАТЬ ОБА ВИДА ОБЪЕКТОВ<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*ПРЕДУСМОТРЕТЬ МЕТОД ПОДСЧЕТА ОТДЕЛЬНО ЗВУКОВЫХ И ВИДЕО-ФАЙЛОВ (ИСПОЛЬЗОВАТЬ ОПЕРАТОР INSTANCEOF)<<<<<<<<<<<<<*
*=============================================================================================================*
*№6 В ПРОГРАММЕ, ГДЕ ТРЕБУЕТСЯ ИЗ МАТРИЦЫ ВЫВЕСТИ СТРОКУ С НОМЕРОМ,<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*ЗАДАННЫМ С КЛАВИАТУРЫ, МОГУТ ВОЗНИКАТЬ ОШИБКИ В СЛЕДУЮЩИХ СЛУЧАЯХ:<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*>>>>>>>>•ВВОД СТРОКИ ВМЕСТО ЧИСЛА<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*>>>>>>>>•НЕТ ТАКОГО НОМЕРА СТРОКИ<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*=============================================================================================================*
*№8 НАПИСАТЬ РЕГУЛЯРНОЕ ВЫРАЖЕНИЕ, ОПРЕДЕЛЯЮЩЕЕ ЯВЛЯЕТСЯ ЛИ ДАННАЯ СТРОЧКА ШЕСТНАДЦАТИРИЧНЫМ ИДЕНТИФИКАТОРОМ<<*
*ЦВЕТА В HTML. ГДЕ #FFFFFF ДЛЯ БЕЛОГО, #000000 ДЛЯ ЧЕРНОГО, #FF0000 ДЛЯ КРАСНОГО И Т.Д. – ПРИМЕР ПРАВИЛЬНЫХ<<<*
*ВЫРАЖЕНИЙ: #FFFFFF, #FF3421, #00FF00. – ПРИМЕР НЕПРАВИЛЬНЫХ ВЫРАЖЕНИЙ: 232323, F#FDDEE, #FD2<<<<<<<<<<<<<<<<<*
*=============================================================================================================*
*№9 НЕ ИСПОЛЬЗУЯ ВСПОМОГАТЕЛЬНЫХ ОБЪЕКТОВ, ПЕРЕСТАВИТЬ ОТРИЦАТЕЛЬНЫЕ ЭЛЕМЕНТЫ ДАННОГО СПИСКА В КОНЕЦ,<<<<<<<<<*
*А ПОЛОЖИТЕЛЬНЫЕ - В НАЧАЛО ЭТОГО СПИСКА<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<*
*=============================================================================================================*
*№10 ИЗОБРАЗИТЬ В ОКНЕ ПРИЛОЖЕНИЯ ОТРЕЗОК, ВРАЩАЮЩИЙСЯ В ПЛОСКОСТИ ФРЕЙМА ВОКРУГ ТОЧКИ, ДВИЖУЩЕЙСЯ ПО ОТРЕЗКУ**
**************************************************************************************************************/
package src;

public class Main {
  public static void main(String[] args) {
    OnScreenFunc.clearScreen();
    SelectionLab.selectTask();
  }
}